tako0910/py32f0-template/Libraries/PY32F032_HAL_Driver/Src/py32f032_hal_tim.c
    /* Configure the Channel 1 in PWM mode */
    TIM_OC1_SetConfig(htim->Instance, sConfig);

    /* Set the Preload enable bit for channel1 */
    htim->Instance->CCMR1 |= TIM_CCMR1_OC1PE;

    /* Configure the Output Fast mode */
    htim->Instance->CCMR1 &= ~TIM_CCMR1_OC1FE;
    htim->Instance->CCMR1 |= sConfig->OCFastMode;
    break;
  }

  case TIM_CHANNEL_2:
  {
    /* Check the parameters */
    assert_param(IS_TIM_CC2_INSTANCE(htim->Instance));

    /* Configure the Channel 2 in PWM mode */
    TIM_OC2_SetConfig(htim->Instance, sConfig);

    /* Set the Preload enable bit for channel2 */
    htim->Instance->CCMR1 |= TIM_CCMR1_OC2PE;

    /* Configure the Output Fast mode */
    htim->Instance->CCMR1 &= ~TIM_CCMR1_OC2FE;
    htim->Instance->CCMR1 |= sConfig->OCFastMode << 8U;
    break;
  }

  case TIM_CHANNEL_3:
  {
    /* Check the parameters */
    assert_param(IS_TIM_CC3_INSTANCE(htim->Instance));

    /* Configure the Channel 3 in PWM mode */
    TIM_OC3_SetConfig(htim->Instance, sConfig);

    /* Set the Preload enable bit for channel3 */
    htim->Instance->CCMR2 |= TIM_CCMR2_OC3PE;

    /* Configure the Output Fast mode */
    htim->Instance->CCMR2 &= ~TIM_CCMR2_OC3FE;
    htim->Instance->CCMR2 |= sConfig->OCFastMode;
    break;
  }

  case TIM_CHANNEL_4:
  {
    /* Check the parameters */
    assert_param(IS_TIM_CC4_INSTANCE(htim->Instance));

    /* Configure the Channel 4 in PWM mode */
    TIM_OC4_SetConfig(htim->Instance, sConfig);

    /* Set the Preload enable bit for channel4 */
    htim->Instance->CCMR2 |= TIM_CCMR2_OC4PE;

    /* Configure the Output Fast mode */
    htim->Instance->CCMR2 &= ~TIM_CCMR2_OC4FE;
    htim->Instance->CCMR2 |= sConfig->OCFastMode << 8U;
    break;
  }

  case TIM_CHANNEL_5:
  {
    /* Check the parameters */
    assert_param(IS_TIM_CC5_INSTANCE(htim->Instance));

    /* Configure the Channel 5 in PWM mode */
    TIM_OC5_SetConfig(htim->Instance, sConfig);

    /* Set the Preload enable bit for channel5 */
    htim->Instance->CCMR3 |= TIM_CCMR3_OC5PE;

    /* Configure the Output Fast mode */
    htim->Instance->CCMR3 &= ~TIM_CCMR3_OC5FE;
    htim->Instance->CCMR3 |= sConfig->OCFastMode;
    break;
  }

  case TIM_CHANNEL_6:
  {
    /* Check the parameters */
    assert_param(IS_TIM_CC6_INSTANCE(htim->Instance));

    /* Configure the Channel 6 in PWM mode */
    TIM_OC6_SetConfig(htim->Instance, sConfig);

    /* Set the Preload enable bit for channel6 */
    htim->Instance->CCMR3 |= TIM_CCMR3_OC6PE;

    /* Configure the Output Fast mode */
    htim->Instance->CCMR3 &= ~TIM_CCMR3_OC6FE;
    htim->Instance->CCMR3 |= sConfig->OCFastMode << 8U;
    break;
  }
  default:
    break;
  }

  htim->State = HAL_TIM_STATE_READY;

  __HAL_UNLOCK(htim);

  return HAL_OK;
}

/**
  * @brief  Initializes the TIM One Pulse Channels according to the specified
  *         parameters in the TIM_OnePulse_InitTypeDef.
  * @param  htim TIM One Pulse handle
  * @param  sConfig TIM One Pulse configuration structure
  * @param  OutputChannel TIM output channel to configure
  *          This parameter can be one of the following values:
  *            @arg TIM_CHANNEL_1: TIM Channel 1 selected
  *            @arg TIM_CHANNEL_2: TIM Channel 2 selected
  * @param  InputChannel TIM input Channel to configure
  *          This parameter can be one of the following values:
  *            @arg TIM_CHANNEL_1: TIM Channel 1 selected
  *            @arg TIM_CHANNEL_2: TIM Channel 2 selected
  * @note  To output a waveform with a minimum delay user can enable the fast
  *        mode by calling the @ref __HAL_TIM_ENABLE_OCxFAST macro. Then CCx
  *        output is forced in response to the edge detection on TIx input,
  *        without taking in account the comparison.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_TIM_OnePulse_ConfigChannel(TIM_HandleTypeDef *htim,  TIM_OnePulse_InitTypeDef *sConfig,
    uint32_t OutputChannel,  uint32_t InputChannel)
{
  TIM_OC_InitTypeDef temp1;

  /* Check the parameters */
  assert_param(IS_TIM_OPM_CHANNELS(OutputChannel));
  assert_param(IS_TIM_OPM_CHANNELS(InputChannel));

  if (OutputChannel != InputChannel)
  {
    /* Process Locked */
    __HAL_LOCK(htim);

    htim->State = HAL_TIM_STATE_BUSY;

    /* Extract the Output compare configuration from sConfig structure */
    temp1.OCMode = sConfig->OCMode;
    temp1.Pulse = sConfig->Pulse;
    temp1.OCPolarity = sConfig->OCPolarity;
    temp1.OCNPolarity = sConfig->OCNPolarity;
    temp1.OCIdleState = sConfig->OCIdleState;
    temp1.OCNIdleState = sConfig->OCNIdleState;

    switch (OutputChannel)
    {
    case TIM_CHANNEL_1:
    {
      assert_param(IS_TIM_CC1_INSTANCE(htim->Instance));

      TIM_OC1_SetConfig(htim->Instance, &temp1);
      break;
    }
    case TIM_CHANNEL_2:
    {
      assert_param(IS_TIM_CC2_INSTANCE(htim->Instance));

      TIM_OC2_SetConfig(htim->Instance, &temp1);
      break;
    }
    default:
      break;
    }

    switch (InputChannel)
    {
    case TIM_CHANNEL_1:
    {
      assert_param(IS_TIM_CC1_INSTANCE(htim->Instance));

      TIM_TI1_SetConfig(htim->Instance, sConfig->ICPolarity,
                        sConfig->ICSelection, sConfig->ICFilter);

      /* Reset the IC1PSC Bits */
      htim->Instance->CCMR1 &= ~TIM_CCMR1_IC1PSC;

      /* Select the Trigger source */
      htim->Instance->SMCR &= ~TIM_SMCR_TS;
      htim->Instance->SMCR |= TIM_TS_TI1FP1;

      /* Select the Slave Mode */
      htim->Instance->SMCR &= ~TIM_SMCR_SMS;
      htim->Instance->SMCR |= TIM_SLAVEMODE_TRIGGER;
      break;
    }
    case TIM_CHANNEL_2:
    {
      assert_param(IS_TIM_CC2_INSTANCE(htim->Instance));

      TIM_TI2_SetConfig(htim->Instance, sConfig->ICPolarity,
                        sConfig->ICSelection, sConfig->ICFilter);

      /* Reset the IC2PSC Bits */
      htim->Instance->CCMR1 &= ~TIM_CCMR1_IC2PSC;

      /* Select the Trigger source */
      htim->Instance->SMCR &= ~TIM_SMCR_TS;
      htim->Instance->SMCR |= TIM_TS_TI2FP2;

